Improve responsive layout and Render docs
